#+title: Stark Bank Challenge

Project meant to create an =Integration= with the [[https://starkbank.com/docs/api#introduction][Stark Bank API]].

We will be using the [[https://github.com/starkbank/sdk-clojure][Clojure API]].

*** Example
#+begin_src clojure :eval no
(gen-three-hours-invoices)
#+end_src

#+RESULTS:
#+begin_example
[{:amount 994400,
  :tags ["scheduled"],
  :name "Aimie Oseph",
  :expiration 383,
  :tax-id "72.034.556/2003-89",
  :due "2022-09-05T16:07:48.809261+00:00",
  :interest 0.03999999910593033,
  :fine 6.239999771118164,
  :descriptions [{:key "Service D20", :value "big"}]}

  (...)

 {:amount 732935,
  :tags ["scheduled"],
  :name "Ms. Rlee Mothy Rolsky Arissa Rdad",
  :expiration 571,
  :tax-id "12.737.391/9287-07",
  :due "2022-09-05T17:06:48.809261+00:00",
  :interest 3.380000114440918,
  :fine 9.890000343322754,
  :descriptions [{:key "Product M69", :value "big"}]}]
#+end_example

*** Start port to localhost
#+begin_src shell
ngrok http 80
#+end_src

#+RESULTS:
: (...)
: Forwarding                    https://cdbc-2804-431-e7c6-ebff-5e62-a7ec-6c56-f3dc.sa.ngrok.io -> http://localhost:80

Finally, copy the ngrok address.

